def MNK(x,y):
    assert len(x)==len(y), "Количество значений должно совпадать"
    a = 0
    for i in range(len(x)):
        a = a+x[i]*y[i]
    a = a/len(x)
    c = 0
    for i in range(len(x)):
        c = c+x[i]
    c = c/len(x)
    d = 0
    for i in range(len(y)):
        d = d+y[i]
    d = d/len(y)
    e = 0
    for i in range(len(x)):
        e = e+x[i]**2
    e=e/len(x)
    k=(a-c*d)/(e-c**2)
    b=d-k*c
    return [k, b]
def test_MNK():
    assert MNK([1,2,3,4,5],[1,2,3,4,5])==[1.0,0.0], "should be [1.0, 0.0]" 
    assert MNK([2,3,4,5,6],[1,2,3,4,5])==[1.0,-1.0], "should be [1.0, -1.0]"
    assert MNK([1,1.9,3.1,3.9,5.1],[1,2.1,2.9,4.1,4.9])==[0.9540229885057471, 0.1379310344827589], "should be [0.9540229885057471, 0.1379310344827589]"
    assert MNK([1,2,3,4,5,6,7,8,9],[133.9,270.3,405.7,542.9,678.7,818.2,953.7,1095.3,1233.3])==[137.39833333333326, -5.658333333332848], "should be [137.39833333333326, -5.658333333332848]"
    assert MNK([1,2,3,4,5,6,7,8,9],[218.1,437.0,656.1,875.0,1095.0,1314.3,1535.0,1755.0,1977.4])==[219.80499999999998, -3.147222222222126], "should be [219.80499999999998, -3.147222222222126]"
test_MNK()
